Repository: 84000/data-translation-memory
Catalog: toh381_84000-emergence-from-samputa.tmx
Source language: bo
Languages: en

source: །དཀར་མོ་ལ་སོགས་རབ་ཏུ་གྲགས།
en: Is also known to be Gaurī and the other goddesses.

source: །ཟླ་བ་མེ་ལོང་ཡེ་ཤེས་ལྡན།
en: “The moon represents mirror-like wisdom,

source: །དེ་བཞིན་མཉམ་ཉིད་ཡེ་ཤེས་ཉིད།
en: And the sun, the wisdom of equality.

source: །རང་ལྷའི་ས་བོན་ཕྱག་མཚན་ནི།
en: The symbols of the chosen deity along with their seed syllables

source: །སོ་སོར་རྟོག་པར་བརྗོད་པར་བྱ།
en: Are said to be discriminating wisdom.

source: །ཐམས་ཅད་གཅིག་གྱུར་ནན་ཏན་ཉིད།
en: “The unity of all of these is action-accomplishing wisdom,

source: །གཟུགས་བརྙན་རྫོགས་པར་དག་པའོ།
en: Which corresponds to the purity of the deity’s full form.

source: །མཁས་པས་ཆོ་ག་གསུངས་པ་ནི། །རྣམ་པ་ལྔ་པོ་བསྒོམ་པར་བྱ།
en: The wise practitioner should cultivate these five aspects According to the sequence just described.

source: །ཨཱ་ལི་ཀཱ་ལི་མཉམ་སྦྱོར་བ།
en: “The union of the vowels and consonants

source: །རྡོ་རྗེ་སེམས་དཔའ་ཉིད་ཀྱི་གདན།
en: Constitutes the seat of Vajrasattva.

source: །ཡི་གེ་ལས་བྱུང་གོང་བུ་ལ།
en: Since the deity embryo arises from a letter,

source: །ཧཱུཾ་ཕཊ་རྣམ་པ་འདོད་མི་བྱ།
en: The syllables hūṁ and phaṭ are not necessary. “He should visualize the chief deity of the maṇḍala

source: །སེམས་པའི་གཟུགས་བརྙན་ལས་བྱུང་བ། །དཀྱིལ་འཁོར་བདག་པོ་བསྒོམ་པར་བྱ།
en: As arising from the syllable, which is the reflection of its essence.

source: །ཕྱག་མཚན་ཞལ་སོགས་གོང་མ་བཞིན།
en: With their faces, attributes, and so forth, as before,

source: །ཟླ་བ་ཆུ་ཤེལ་ནོར་བུའི་འོད།
en: With the radiance of the moon-stone gem, “All the goddesses manifest in full

source: །ཐབས་དང་ཤེས་རབ་རང་བཞིན་ལས། །དེ་ལྟར་ཐམས་ཅད་རྫོགས་པ་ཉིད།
en: From the nature of skillful means and wisdom.

source: །ཨཱ་ལི་ཤེས་རབ་ཀཱ་ལི་ཐབས།
en: The vowels are wisdom and the consonants, means,

source: །ཟླ་བ་ཉི་མའི་རབ་དབྱེ་བ།
en: Reflecting the distinction between the moon and sun.

source: །གང་ཕྱིར་དཀར་མོ་ལ་སོགས་པ།
en: “Since Gaurī and the others should appear one by one,

source: །ཁ་དོག་དབྱེ་བ་སོ་སོ་ཡིན།
en: Following the division of the colors,

source: །དེ་ཕྱིར་ཀུན་ཏུ་རབ་འབད་པས།
en: He should make every effort

source: །དཀྱིལ་འཁོར་པ་ཡང་རབ་ཏུ་བརྟག །རྣལ་འབྱོར་མ་ལྔ་འདི་དག་ནི།
en: To correctly execute the maṇḍala procedure. “The following five yoginīs are positioned

source: །ནང་གི་འཕར་མ་ཡང་དག་གནས།
en: Within the inner enclosure; The yoga adept should always conceive them to be,

source: །ཕུང་པོ་ལྔ་ཡི་རང་བཞིན་གྱིས།
en: In their natures, the five aggregates:

source: །རྣལ་འབྱོར་རིག་པས་རྟག་ཏུ་བསྒོམ།
en: “Vajrā is in the east;

source: །དབང་པོར་རྡོ་རྗེ་གཤིན་རྗེར་དཀར།
en: Gaurī is in the south;

source: །ཆུ་བདག་ཆུ་ཡི་རྣལ་འབྱོར་མ།
en: Vāriyoginī is in the west;

source: །ལུས་ངན་རྡོ་རྗེ་མཁའ་འགྲོ་མ།
en: Vajraḍākinī is in the north;

source: །དབུས་སུ་བདག་མེད་རྣལ་འབྱོར་མ།
en: And the yoginī Nairātmyā is in the center.

source: །ཕྱི་རོལ་འཕར་མར་དཀར་མོ་དང་། །ཆོམ་རྐུན་དེ་བཞིན་རོ་ལངས་མ།
en: “Within the outer circle there are the following: “Gaurī, Caurī, and Vetalī;

source: །གྷ་སྨ་རཱི་དང་པུཀྐ་སཱི།
en: So too, Ghasmarī and Pukkasī.

source: །རི་ཁྲོད་མ་དང་གདོལ་པ་མོ།
en: Further, there are Śavarī and Caṇḍālī,

source: །བརྒྱད་པ་གཡུང་མོས་གང་བའོ།
en: With Ḍombī completing the octet.

source: །འོག་ལྡན་མ་དང་སྟེང་ལྡན་ཉིད། །མཁའ་སྤྱོད་ས་སྤྱོད་མ་ཞེས་བརྗོད།
en: “Down below and up above are known to be,

source: །སྲིད་དང་ཞི་བའི་རང་བཞིན་གྱིས།
en: Respectively, Bhūcarī and Khecarī—

source: །ངོས་སུ་གྱུར་མ་ཡང་དག་གནས།
en: The first, moving, the other, stationary. They have the nature of saṃsāra and nirvāṇa respectively.

source: །ལྷ་མོ་ཐམས་ཅད་སྣ་ཚོགས་མདོག །དྲག་ཆེན་ཕྱག་རྒྱ་ལྔ་ཡིས་བརྒྱན།
en: “All these goddesses can be described as follows: “They are different colors, very wild, And adorned with the five mudrās.

source: །སྤྱན་གསུམ་གསལ་བའི་གཟུགས་ཅན་མ།
en: Three eyes, and are divinely beautiful. “They each wear a choker, earrings,

source: །འཁོར་ལོ་རྣ་ཆ་མགུལ་རྒྱན་དང་། །ལག་པར་གདུ་བུ་སྐ་རགས་ཉིད།
en: A wrist bracelet, and a waist chain.

source: །སངས་རྒྱས་ལྔ་ནི་རྣམ་དག་པས།
en: They are adorned with the five buddhas,

source: །འདི་ལྔ་ཕྱག་རྒྱ་དག་པར་གསུངས། །ཇི་ལྟར་བདག་མེད་རྣལ་འབྱོར་མ།
en: Which constitute their five pure seals.

source: །དེ་ལྟར་ཐམས་ཅད་རྣམ་པར་བཤད།
en: “Each of them is said to look Like the yoginī Nairātmyā,

source: །གཡོན་པས་རྣལ་འབྱོར་ལྷུང་བཟེད་དང་། །དེ་བཞིན་སྟེང་དུ་ཁ་ཊྲཱ་ག །གཡས་ན་རྡོ་རྗེ་སྔོན་པོ་དང་། །དེ་བཞིན་དུ་ཡང་གྲི་གུག་ཉིད།
en: Who, on her left side, holds a yogic alms bowl And an upward-pointing khaṭvāṅga. “On her right side she holds a blue vajra scepter And a flaying knife.

source: །རོ་ལ་ཞོན་ཞིང་གཟི་བརྗིད་འབར།
en: She stands on a corpse, ablaze with flames,

source: །སྤྱན་དམར་དེ་བཞིན་སྟེང་སྐྱེས་སེར།
en: With red eyes and yellow, upward-flowing hair.

source: །ཁ་དོག་སྔོན་མོ་ཆེས་གསལ་མ།
en: “She is blue, brilliantly luminous,

source: །སྟག་གི་པགས་པས་རྣམ་དཀྲིས་ཤིང་།
en: And her hips are wrapped with a tiger skin. She sits there in her divine beauty,

source: །འཇིགས་པའི་མེ་ནི་ལྟ་བུར་ནི། །གསལ་བའི་གཟུགས་ཅན་མ་དེ་གནས།
en: Glowing like the fire during the final destruction.

source: །གཡས་ན་དཀར་དང་སྔོ་བ་སྟེ།
en: “To her right there is a yellow and blue goddess, Khecarī;

source: །གཡོན་ན་མ་རྒད་སྔོ་དང་མཚུངས།
en: To her left there is a red and blue one, Bhūcarī.

source: །ལག་པ་གཅིག་ནི་ཐོད་པས་བྲེལ།
en: “They all extend forward their left hands, which hold skull cups,

source: །གཡས་ན་གྲི་གུག་འཛིན་པ་མ།
en: And hold in their right hands flaying knives.

source: །རྒོད་དང་ཁྲོ་དང་སྒེག་པ་དང་། །དེ་ནི་མཆོད་པའི་གཟུགས་གནས་པས།
en: They express the moods of mirth, anger, and sensuality,

source: །སངས་རྒྱས་སྤྲིན་དང་མཉམ་པ་ཡི།
en: Abiding in the nature of reverence for him. “The wise practitioner should visualize himself in the center As the identity of the natures of the three tattvas

source: །འོད་ཟེར་སྣ་ཚོགས་ཀུན་ཏུ་སྤྲོ།
en: Radiating all around light of different colors,

source: །དེ་ཉིད་གསུམ་གྱི་རང་བཞིན་བདག །མཁས་པས་དབུས་སུ་བསྒོམ་པར་བྱ།
en: Composed of scintillating clouds of buddhas.”

source: །གསུམ་པ་ལས་རབ་ཏུ་བྱེད་པ་གསུམ་པའོ།།
en: This concludes the third part of the third chapter. “Now I will teach

source: །།དེ་ནས་དཀྱིལ་འཁོར་ཆེན་པོ་མཆོག །ཡང་དག་རབ་ཏུ་བཤད་པར་བྱ།
en: The supreme great maṇḍala,

source: །རྡོ་རྗེ་དབྱིངས་དང་མཉམ་པའི་དབྱིབས།
en: Which has the form of the vajradhātu

source: །རྡོ་རྗེ་དབྱིངས་ཞེས་བྱ་བར་གསུངས།
en: And is known as the vajradhātu itself.

source: །དཀྱིལ་འཁོར་གནས་ནི་སྦྱངས་ནས་ནི།
en: “One should purify the maṇḍala site,

source: །ཕྱག་རྒྱ་ཆེན་པོར་ཡོངས་སུ་གཟུང་།
en: Making it into a place of the great seal. The follower of Mantra should execute the following,

source: །ཐམས་ཅད་རྣམ་པར་བལྟས་ནས་ནི།
en: Watching over every detail:

source: །སྔགས་པས་འདི་ནི་བསྒྲུབ་པར་བྱ།
en: “The wise practitioner should delimit the maṇḍala, To the best of his ability, using a thread That is new, well woven,

source: །སར་པ་ལེགས་པར་བཀལ་བ་དང་། །ཤིན་ཏུ་ཚད་མ་མཛེས་པས་ནི། །སྲད་བུས་ཐིག་གདབ་ཤེས་རབ་ཅན།
en: Of the right length, and beautiful.

source: །ཇི་ལྟར་ནུས་པར་དཀྱིལ་འཁོར་ཉིད། །གྲུ་བཞི་པ་ལ་སྒོ་བཞི་པ།
en: “The maṇḍala should have four corners and four doors,

source: །རྟ་བབས་རྣམས་ཀྱིས་ཤིན་ཏུ་མཛེས།
en: And be finely adorned with porticos.

source: །ཐིག་བཞི་དང་ནི་ཡང་དག་ལྡན།
en: It should be provided with four threads

source: །གོས་དང་མེ་ཏོག་ཕྲེང་བས་བརྒྱན།
en: And adorned with fine fabrics and flower garlands

source: །མཚམས་ཀྱི་ཆ་རྣམས་ཐམས་ཅད་དང་། །སྒོ་ཡི་ཁྱུད་ཀྱི་གྲྭ་རྣམས་སུ།
en: “On all its sides,

source: །རྡོ་རྗེ་རིན་ཆེན་རྣམས་ཀྱིས་སྤྲས།
en: Which are provided with gate-turrets,

source: །ཕྱི་རོལ་དཀྱིལ་འཁོར་ཐིག་གདབ་བྱ།
en: He should delimit the outer maṇḍala

source: །དེ་ཡི་འཁོར་ལོ་སོ་སོའི་སྐབས།
en: With lines of jewel-studded vajra scepters.

source: །ནང་དུ་ཡང་ནི་ཞུགས་ནས་ནི།
en: “He should then enter the inner court, Which has the shape of a circle;

source: །རྡོ་རྗེ་ཐིག་ནི་ཡོངས་བཅུག་ཅིང་།
en: It is strewn with vajra threads

source: །ཀ་བ་བརྒྱད་ཀྱིས་ཉེ་བར་མཛེས།
en: And adorned with eight pillars.

source: །རྡོ་རྗེ་ཀ་བའི་རྩེར་གནས་པ། །དཀྱིལ་འཁོར་ལྔ་ཡིས་རྣམ་པར་བརྒྱན།
en: “It is adorned with five circles Situated atop the vajra pillars.

source: །དེ་ནས་དཀྱིལ་འཁོར་ནང་དུ་ནི།
en: Then, in the center of the maṇḍala,

source: །སངས་རྒྱས་གཟུགས་བརྙན་རྣམ་པར་དགོད། །གསུངས་པའི་དཀྱིལ་འཁོར་ཆོ་ག་ཡང་།
en: He should place an image of the Buddha.

source: །སྒྲུབ་པའང་ཁྱོད་ལ་བཤད་པར་བྱ།
en: “Now I will explain to you the practice

source: །དེ་ལ་དང་པོར་ལྷ་ཉིད་ཀྱི། །ཁྱིམ་དུ་སྔགས་པ་ཞུགས་ནས་ནི།
en: Connected with the maṇḍala procedure just described.

source: །ཨ་ལས་ཟླ་བའི་དཀྱིལ་འཁོར་ནི།
en: “Starting precisely from there, the follower of Mantra should enter this dwelling of the deity and visualize a moon disk transformed from the letter a

source: །བསམས་ནས་དེ་སྟེང་རྡོ་རྗེ་ནི། །དཀར་པོ་རྩེ་མོ་ལྔ་པ་ཉིད། །ཆོ་གས་བསམ་པར་བྱས་ནས་ནི།
en: Above the disk, he should visualize a white, five-pointed vajra scepter, according to procedure.

source: །དེ་བཞིན་གཤེགས་པ་ཀུན་སོགས་ལ། །མཆོད་ནས་ཕྱག་འཚལ་འདི་སྐད་གསོལ།
en: Having then made offerings to all the tathāgatas, and so forth, he should prostrate himself, and say the following:

source: །སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན། །བདག་ལ་དགོངས་པ་མཛད་དུ་གསོལ། །བདག་ནི་ཆེ་གེ་མོ་ཞེས་བགྱི།
en: ‘May all buddhas and bodhisattvas please keep me in their heart!

source: །དུས་འདི་ནས་ནི་བཟུང་ནས་ནི།
en: From now until I sit on the throne of liberation, I, named such and such, “ ‘Give rise to the altruistic aspiration set on awakening—

source: །ཇི་སྲིད་བྱང་ཆུབ་སྙིང་པོའི་བར།
en: Supreme and unsurpassable—

source: །ཇི་ལྟར་དུས་གསུམ་མགོན་པོ་རྣམས།
en: Just as the buddhas of the three times

source: །བྱང་ཆུབ་ཏུ་ནི་ངེས་མཛད་པའི།
en: Made their firm resolve to attain perfect awakening.

source: །བྱང་ཆུབ་སེམས་ནི་བླ་མེད་མཆོག །དམ་པ་བདག་གིས་བསྐྱེད་པར་བགྱི།
en: ‘I will firmly observe each of the three kinds of bodhisattva ethics:

source: །དགེ་བའི་ཆོས་ནི་སྡུད་པ་དང་། །སེམས་ཅན་དོན་བྱེད་ཚུལ་ཁྲིམས་དང་། །ཚུལ་ཁྲིམས་བསླབ་པ་རྣམ་པ་གསུམ།
en: The training in ethical discipline, The gathering of wholesome qualities, And the ethics of acting for the benefit of beings.

source: །སོ་སོར་བདག་གིས་བརྟན་པར་གཟུང་།
en: ‘From now onward I will firmly uphold The vow, born from the union with the buddhas,

source: །སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་ཏེ།
en: Of Buddha, Dharma, and Saṃgha,

source: །བླ་ན་མེད་པའི་དཀོན་མཆོག་གསུམ། །སངས་རྒྱས་རྣལ་འབྱོར་ལས་སྐྱེས་པའི། །སྡོམ་པ་དེང་ནས་བརྟན་པོར་གཟུང་།
en: The three foremost and unsurpassable jewels.

source: །རྡོ་རྗེ་རིགས་མཆོག་ཆེན་པོ་ལ།
en: ‘Within the fold of the great vajra family,

source: །རྡོ་རྗེ་དྲིལ་བུ་ཕྱག་རྒྱ་ཡང་།
en: I will firmly uphold the vajra, bell, and hand gestures

source: །དེ་ཉིད་ལས་ནི་སོ་སོར་གཟུང་།
en: According to their true nature.

source: །སློབ་དཔོན་དག་ཀྱང་གཟུང་བར་བགྱི།
en: I will commit myself to the master.

source: །རིན་ཆེན་རིགས་ཀྱི་རྣལ་འབྱོར་གྱིས། །དམ་ཚིག་ཡིད་དུ་འོང་བ་ལ།
en: ‘Within the great jewel family, as is fitting,

source: །ཉི་མ་རེ་རེ་དྲུག་བྱས་ནས། །སྦྱིན་པ་རྣམ་བཞི་རབ་ཏུ་སྦྱིན།
en: I shall bounteously give the four kinds of gifts, Performing this six times each day As my delightful samaya. “ ‘Within the great pure lotus family,

source: །བྱང་ཆུབ་ཆེན་པོ་ལས་བྱུང་བ།
en: Which emerges from great awakening,

source: །པདྨའི་རིགས་མཆོག་དག་པ་ལ།
en: I shall uphold the true Dharma—

source: །ཕྱི་དང་གསང་བ་ཐེག་པ་གསུམ། །དམ་པའི་ཆོས་ཀྱང་སོ་སོར་གཟུང་།
en: The exoteric and esoteric dimensions pertaining to the three vehicles.

source: །ལས་ཀྱི་རིགས་མཆོག་ཆེན་པོ་ལ།
en: ‘Within the fold of the great activity family

source: །སྡོམ་པ་ཐམས་ཅད་ལྡན་པར་ནི།
en: I shall uphold, in every respect,

source: །ཐམས་ཅད་སོ་སོར་གཟུང་བར་བྱ།
en: The all-encompassing vow

source: །མཆོད་པའི་ལས་ཀྱང་ཅི་ནུས་བགྱི།
en: And perform the act of worship to the best of my ability. “ ‘Now that I have given rise to the altruistic aspiration set on awakening—

source: །བྱང་ཆུབ་སེམས་ནི་བླ་མེད་པོ།
en: Supreme and unsurpassable—

source: །དམ་པ་བདག་གིས་བསྐྱེད་པར་བགྱི།
en: And taken all the vows

source: །སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར།
en: For fulfilling the needs of all beings,

source: །སྡོམ་པ་མ་ལུས་གཟུང་བར་བགྱི།
en: ‘I shall ferry across those that have not yet crossed,

source: །མ་བསྒྲལ་བ་དག་བསྒྲལ་བར་བགྱི། །མ་གྲོལ་བ་དག་སྒྲོལ་བར་བགྱི།
en: I shall liberate those that have not been liberated,

source: །དབུགས་མ་ཕྱིན་པ་དབུགས་དབྱུང་ཞིང་།
en: And I shall give comfort to the desolate,

source: །སེམས་ཅན་མྱ་ངན་འདས་ལ་གཞག །དེ་ནས་བཅོམ་ལྡན་འདས་རྡོ་རྗེ་འཛིན་པ་ཐམས་ཅད་ཀྱི་རྩེ་མོ་ལས་བྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཏེ་ཚིག་འདི་དག་བཀའ་སྩལ་པ།
en: Establishing all beings in nirvāṇa.’ ” Then the lord entered the meditative absorption called “that which arises from the pinnacle of all vajra holders” and gave this inspiring teaching:

source: དེ་ནས་བསམ་གཏན་གནས་འདུག་ནས། །ཆོས་རྣམས་ཐམས་ཅད་བདག་མེད་པར། །ཡང་དག་རྗེས་སུ་བལྟ་བར་བྱ།
en: “Now, staying in a place suitable for meditation, he should observe the absence of intrinsic identity in all phenomena.

source: །ཕྱི་དང་ནང་གི་བདག་ཉིད་ཅན། །འདི་དག་ཐམས་ཅད་སེམས་ཀྱིས་བརྟགས།
en: Everything of an external and internal nature is imputed by mind.

source: །སེམས་ལས་མ་གཏོགས་པ་ཉིད་ནི། །གཞན་དུ་ཡོང་པ་མ་ཡིན་ནོ།
en: There is nothing else that exists beyond mind.

source: །ཆོས་ཀུན་རང་བཞིན་འོད་གསལ་བ། །ཆོས་ཀུན་དང་པོར་མ་སྐྱེས་ཕྱིར། །ཡིད་ཀྱིས་ཨ་ནུཏྤནྣ་བརྗོད།
en: Since all phenomena, being luminous, have never arisen in the first place, he should mentally declare them to be unproduced.

source: །དེ་ནས་རང་སེམས་དེ་ཉིད་འདིས། །རང་བཞིན་གྱིས་ནི་འོད་གསལ་བ། །འདོད་པའི་སྔགས་ཀྱིས་བཟླས་པས་ནི། །ཟླ་བའི་དཀྱིལ་འཁོར་རྣམ་པར་བལྟ། །ཨོཾ་ཙིཏྟ་པྲ་ཏི་བེ་དྷྃ་ཀ་རོ་མི།
en: Then he should perceive his own mind, which is luminous by nature, in the form of a moon disk, while reciting the following mantra with enthusiasm: “ ‘ Oṁ , I penetrate my mind.’

source: ཚོགས་ཀྱི་དཀྱིལ་འཁོར་ཆེ་དག་པ།
en: “This mind is like the sky—

source: །ནམ་མཁའ་ལྟ་བུ་དྲི་མ་མེད།
en: Stainless despite the presence of clouds.

source: །ཡིད་གཉིས་ཀུན་ལས་རྣམ་པར་གྲོལ།
en: It is free from all dejection,

source: །མཆོག་ཏུ་རྣམ་པར་རྟོག་པ་འཇོམས།
en: Being utterly devoid of mental constructs.

source: །ཉོན་མོངས་དྲི་མ་ཐམས་ཅད་དག །དང་པོ་ཟླ་བ་ལྟར་བལྟས་ནས།
en: “First it is visualized as the moon, Cleansed of all the dirt of afflictions.

source: །སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་འདིར།
en: Therein enter all the qualities of the awakened ones

source: །ཨ་སོགས་གཟུགས་ཀྱིས་འཇུག་པར་འགྱུར།
en: In the form of the short letter a , and so forth: “ a ā i ī u ū ṛ

source: །ཨ་ཨཱ་ཨི་ཨཱི་ཨུ་ཨཱུ་རྀ་རཱྀ་ལཱྀ་ལཱྀ་ཨེ་ཨཻ་ཨོ་ཨཽ་ཨྃ་ཨཿ།
en: ṝ ḷ ḹ e ai o au aṃ aḥ

source: བཅོམ་ལྡན་ཟླ་བའི་དཀྱིལ་འཁོར་གྱི།
en: Vajragarbha then asked:

source: །ཡོན་ཏན་ཁྱད་པར་ཇི་ལྟར་ལགས།
en: “What qualities, O Blessed One, Make this moon disk unique?”

source: །གྲུ་གསུམ་རྒྱ་ཆེན་རང་བཞིན་ཅན།
en: “It has three corners, is big in size, and is

source: །སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་གནས།
en: A receptacle for the qualities of all awakened ones.

source: །འདི་ནི་ཨ་སོགས་གཟུགས་ཀྱིས་ནི། །སངས་རྒྱས་ཡོན་ཏན་འཇུག་པར་འགྱུར།
en: “These qualities of the awakened ones enter into it in the form of the letter a , and the rest.

source: །ཤེལ་དང་ཟླ་བ་ལྟ་བུར་ནི། །དེ་ཡི་སྟེང་དུ་འཇུག་པར་འགྱུར། །སེམས་ནི་རང་བཞིན་འོད་གསལ་བས། །དེ་ཉིད་དགའ་བར་བྱེད་པའི་རྒྱུ། །སྔགས་པས་འདི་ཡི་སྔགས་ཀྱིས་ནི།
en: Possessing the luster of a crystal or the moon, they come in atop the moon disk, causing the mind, which is luminous by nature, to expand. The follower of Mantra should then generate the altruistic aspiration for awakening with the following mantra:

source: །བྱང་ཆུབ་སེམས་ནི་སྐྱེད་པར་བྱེད།
en: Oṁ , I give rise to bodhicitta.

source: །ཨོཾ་བོ་དྷི་ཙིཏྟ་ཨུཏྦཱ་ད་ཡཱ་མི། བྱས་པའི་རྗེས་སུ་རིམ་འབྱུང་བ།
en: “This bodhicitta arises from having performed this rite,

source: །སེམས་ཅན་རྗེས་སུ་འཛིན་པ་པོ།
en: And it begets kindness toward all beings.

source: །དགེ་བའི་ཆོས་ཀྱིས་ཡང་དག་གང་།
en: It is replete with wholesome qualities

source: །ཉོན་མོངས་ཐམས་ཅད་ངེས་པར་གནོན།
en: And destroys all afflictions.

source: །ཟླ་བའི་དཀྱིལ་འཁོར་དབུས་སུ་ནི།
en: “In the center of the moon disk

source: །བྱང་ཆུབ་ཟླ་བ་གཉིས་པ་ཅན།
en: There is a second one—the moon of awakening.

source: །འདིར་ཡང་སྐར་མའི་རྣམ་པས་ནི། །སངས་རྒྱས་ཡོན་ཏན་ཀ་སོགས་ཀྱི། །གཟུགས་ཀྱིས་གཟུགས་བརྙན་ལྟ་བུ་ཡི། །རྣལ་འབྱོར་གྱིས་ནི་འཇུག་པར་འགྱུར། །ཀ་ཁ་ག་གྷ་ང་། ཙ་ཚ་ཛ་ཛྷ་ཉ། ཊ་ཋ་ཌ་ཌྷ་ཎ།
en: “Here, too, the qualities of the awakened ones enter like stars in the form of the syllables ka , and so forth, by means of the qualities being reflected in the syllables.

source: ཏ་ཐ་ད་དྷ་ན། པ་ཕ་བ་བྷ་མ། ཡ་ར་ལ་ཝ།
en: These syllables are:

source: ཤ་ཥ་ས་ཧ་ཀྵཿ།
en: ka kha ga gha ṅa ca cha ja jha ña ṭa ṭha ḍa ḍha ṇa ta tha da dha na pa pha ba bha ma ya ra la va śa ṣa sa ha kṣaḥ

source: འདི་ཡི་དཀྱིལ་འཁོར་ཆོ་ག་ཀུན། །རྒྱུད་ནི་གཞན་དུ་མ་གསུངས་སོ། །དེ་ལ་དབུས་སུ་རྩེ་ལྔ་པ།
en: “This maṇḍala procedure has not been taught in its entirety in other tantras.

source: །འོད་ཟེར་དཀར་པོ་བཅས་པ་ཉིད། །ཀུན་ཏུ་བཟང་པོའི་སེམས་བསྐྱེད་པས།
en: Here, in addition, in order to stabilize the generation of the mind of Samantabhadra, he should visualize himself in the image of a radiant, white vajra scepter there in the middle of the aforementioned moon disk, while reciting the following mantra: “ Oṁ vajra!

source: །བརྟན་པར་བྱེད་པའི་རྒྱུ་ཡི་ཕྱིར། །བདག་ཉིད་རྡོ་རྗེའི་གཟུགས་བརྙན་དུ། །འདི་ཡི་སྔགས་ཀྱིས་བསྒོམ་པར་བྱ། །ཨོཾ་ཏིཥྛ་བཛྲ།
en: Please remain.

source: བྱང་ཆུབ་སྤྱོད་པ་བླ་ན་མེད།
en: “This conduct of awakening is unsurpassable.

source: །དེ་ཡི་ས་ནི་རྟོགས་པ་འདི།
en: Its basis, it should be well understood,

source: །ཡེ་ཤེས་དག་པ་ཟག་པ་མེད།
en: Is pristine, stainless wisdom without karmic stains.

source: །རྡོ་རྗེ་ངེས་པར་བརྟག་པར་བྱ།
en: He should visualize a vajra scepter.

source: །ནམ་མཁའི་ཁམས་ནི་ཐམས་ཅད་ཀྱི། །ཚད་དུ་ཡང་དག་གང་བ་ཡི། །རྡོ་རྗེའི་ལུས་ཀྱི་བདག་ཉིད་དུ། །སྔགས་པས་བསྒོམ་པར་བྱ་བའོ། །འདིས་ནི་སྔགས་ཀྱི་རྣལ་འབྱོར་གྱིས།
en: “A follower of Mantra should visualize himself with a vajra body that extends throughout the entire expanse of space.

source: །སྤྲོ་བ་དང་ནི་བསྡུ་བར་བྱ།
en: “Then, while practicing the radiation and absorption Of tiny vajra scepters, he should recite the following mantra:

source: །ཨོཾ་བཛྲ་ཨཱཏྨ་ཀོ྅་ཧྃ།
en: Oṁ , I am of the nature of vajra.

source: སངས་རྒྱས་ཀུན་གྱི་སྐུ་གང་ནི།
en: “This vajra, which is the body of all the buddhas,

source: །སྣང་བ་མེད་ཅིང་གནས་པ་མེད།
en: Has neither appearance nor abode.

source: །མ་སྐྱེས་མ་བྱས་དག་པ་ཉིད།
en: It is unborn, unfabricated, pure,

source: །དངོས་པོ་མེད་པ་ལ་སོགས་སྤངས།
en: And devoid of nonexistence, and so forth.

source: །གཅད་མེད་དབྱེར་མེད་གཟུང་དུ་མེད།
en: “It is unbreakable, indivisible, and ungraspable;

source: །ཆོས་ཀྱི་སྐུ་ནི་གཟུགས་མེད་པ།
en: It is the dharmakāya free of attributes;

source: །རྡོ་རྗེ་བདག་མེད་ཡང་དག་གྱུར།
en: It arises as the nature of vajra and is therefore

source: །རྡོ་རྗེའི་སྐུ་ནི་གོང་ན་མེད།
en: The unsurpassable vajra body.” Vajragarbha then asked, “How do I further meditate on this vajra, O Blessed One?” The Blessed One said, “May all the tathāgatas listen!

source: །དེ་ལྟར་ཡང་དེ་རྡོ་རྗེས་མཚན་པ་བསྒོམ་པར་བྱ་བ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཉོན་ཅིག །ཡང་ནི་རྡོ་རྗེ་སེམས་དཔའ་ནི། །རྣམ་པ་ཀུན་གྱི་མཆོག་ལྡན་པ། །སངས་རྒྱས་རྣམས་ཀྱི་གཟུགས་བརྙན་ནི། །འདི་ཡི་སྔགས་ཀྱིས་བསྒོམ་པར་བྱ།
en: One should again visualize Vajrasattva—the reflection of the buddhas endowed with the supreme of all characteristics—while reciting the following mantra:

source: །ཨོཾ་ཡ་ཐ་སརྦ་ཏ་ཐཱ་གཱ་ཏཱ་སྟ་ཐཱ་ཧྃ།
en: Oṁ , I am just like all the tathāgatas.

source: སྐུ་དང་གསང་བ་དེ་བཞིན་སྤྱོད།
en: “The buddha body, its secret nature, and the conduct,

source: །སྤྱོད་ཡུལ་དེ་ཉིད་རྟོགས་པ་ནི།
en: The range of experience, and the awakening to reality—

source: །མངོན་པར་བྱང་ཆུབ་རྣམ་པ་ལྔ།
en: These are the five aspects of perfect awakening,

source: །སངས་རྒྱས་ཀུན་གྱི་བདག་ཉིད་དགེ།
en: The pure nature of all the buddhas.”

source: །དེ་ནས་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྡོ་རྗེ་སྙིང་པོ་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then the great bodhisattvas, led by Vajragarbha, addressed the Blessed One yet again:

source: །བཅོམ་ལྡན་འདས་གསང་བའི་རྡོ་རྗེ་དང་། པདྨའི་རིགས་ཀྱི་མིང་ཅི་ལགས།
en: “What, O Blessed One, are the secret vajra and lotus families?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The lord said:

source: རྡོ་རྗེ་དེ་བཞིན་གཤེགས་པ་ཀུན་ལ་གནས།
en: “The vajra family abides in all tathāgatas;

source: །པདྨའི་རིགས་ནི་ལྷ་མོ་ཆེན་མོ་ལྡན།
en: The lotus family includes great goddess deities.

source: །དེ་ཡི་རྡོ་རྗེ་པདྨའི་སྟེང་དུ་གནས།
en: That is why the vajra scepter is positioned above the lotus flower—

source: །དེ་ལས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དོན།
en: From there issue forth all the tathāgatas.

source: །དེ་ནས་དེ་ལྟར་བདག་ཉིད་རྣམ་པར་སྣང་མཛད་དུ་བསྐྱེད་ནས་སྟེང་དང་འོག་ཏུ་སྔགས་ཀྱི་ཡི་གེ་བཀོད་དེ།
en: “In this manner, one should generate oneself as Vairocana, visualizing, above and below, the syllables of the mantra.

source: ཆོ་ག་བཞིན་དུ་རི་རབ་དང་། གྲུ་གསུམ་རྒྱ་ཆེན་པོ་བསྐྱེད་པར་བྱ་སྟེ། འོད་ཟེར་སྣ་ཚོགས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་བརྒྱན་པ་ལས་ཡང་དག་པར་བྱུང་བའི་མཛེས་པའི་གནས་བསྒོམས་ནས།
en: Following the usual procedure, one should then emanate Mount Sumeru and a vast triangle, adorned with a maṇḍala of different colored lights.

source: དེར་བྃ་ལས་བྱུང་བའི་སྣ་ཚོགས་པདྨར་ཉི་མའི་དཀྱིལ་འཁོར་རོ།
en: One should visualize, arising there, a beautiful palace, and in it, the syllable paṁ , which transforms into a multicolored lotus with a sun disk atop it.

source: །རླུང་དང་མེའི་དཀྱིལ་འཁོར་དང་ལྡན་པ་ཡ་ར་ལ་ཝས་བརྒྱན་པའོ།
en: This is adorned with the syllables ya , ra , la , and va , in conjunction with the maṇḍalas of wind, fire, and so forth.

source: །དེ་ནས་དེའི་སྟེང་དུ་སྔགས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསོལ་བ་བཏབ་ཅིང་བསྟོད་པ། རབ་ཏུ་བསྔགས་པ། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་འོད་གསལ་བ་དང་། །ཁ་དོག་སྣ་ཚོགས་ཤིང་དྲིལ་བུ་དཔྱངས་པ་དང་། རླུང་གིས་བསྐྱོད་པའི་གོས་དང་། འཕན་དང་། མེ་ཏོག་གི་ཕྲེང་བ་དང་། དོ་ཤལ་དང་། དོ་ཤལ་ཕྱེད་པ་དང་། ཟླ་བས་ཉེ་བར་མཛེས་པར་རྡོ་རྗེ་ནོར་བུའི་རྩེ་མོར་གཞལ་མེད་ཁང་བསམ་པར་བྱའོ།
en: Then, above that, with the appropriate mantra, one should visualize a temple palace surmounted with a vajra-jewel pinnacle, shining with various jewels and gems, and adorned with colorful streamers and banners with tiny bells attached to them, shaken by the wind. The palace is further adorned with garlands, chaplets, multi-string chains of pearls, and moon crescents. It is praised and glorified by all the tathāgatas inhabiting it.

source: །ཧཱུྃ་གི་སྔགས་འདིས་རང་གི་སྙིང་ཁར་ཟླ་བའི་དཀྱིལ་འཁོར་དུ་སྔགས་འདི་བཀོད་དེ་གྱུར་པ་ལས་རྡོ་རྗེ་རྩེ་ལྔ་པ་བསྒོམ་པར་བྱའོ།
en: While visualizing this one should recite the mantra hūṁ . “Having placed this mantra, hūṁ , on a moon disk in one’s heart, one should visualize that it transforms into a five-pronged vajra scepter.

source: །ཡང་སངས་རྒྱས་ཐམས་ཅད་སྤྲོ་བ་དང་བསྡུ་བར་བྱ་ཞིང་རྡོ་རྗེ་དེ་ཉིད་ཡང་ཡོངས་སུ་གྱུར་པ་ལས་རྡོ་རྗེ་སེམས་དཔའ་རྣམ་པ་ཀུན་གྱི་མཆོག་དང་ལྡན་པ་ཟླ་བའི་ཁ་དོག་གི་འོད་ལྟ་བུ་སྟེ།
en: One should repeatedly radiate from it five-pronged vajra scepters, and absorb them all back as buddhas. Next, one should visualize that the very same vajra scepter transforms into Vajrasattva, radiant like the color of the moon, and endowed with the supreme of all characteristics.

source: ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་སྟེང་ན་བཞུགས་ཤིང་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ།
en: “Sitting on a moon disk, And adorned with all kinds of adornments,

source: དཔའ་པོ་ཤེས་རབ་དང་དགའ་བ་གཅིག་པུས་མཛེས་པས་རྡོ་རྗེ་དང་། དྲིལ་བུ་དང་། རལ་གྲི་དང་། ལྕགས་ཀྱུ་ཉིད་དང་། ཐོད་པ་དང་། ཞགས་པ་འཛིན་པ་ཉིད་དོ།
en: The hero, handsome in his singular wisdom and joy, Is holding a vajra scepter, a bell, “A sword, a goad, A skull cup, and a noose.

source: །གཡས་པ་ནི་ཁ་དོག་ནག་པོའོ།
en: The face on the right is black,

source: །གཡོན་པ་ནི་པདྨ་རཱ་གའི་འོད་དོ།
en: And the one on the left, red.

source: །ཞལ་གསུམ་པ་དང་། ཕྱག་དྲུག་པ་ཉིད་དང་། སྤྱན་གསུམ་པ་ཉིད་དང་། བཟང་པོའི་གཟུགས་ཅན་ཏེ།
en: “He has three faces and six arms And is divinely beautiful, with three eyes on each of his faces. One should visualize him in a maṇḍala of pleasure,

source: རང་གི་རིག་མའི་པདྨ་ལ་བཞུགས་པ།
en: Nestled in the lotus of his consort

source: །དགྱེས་པའི་དཀྱིལ་འཁོར་བསྒོམ་པར་བྱའོ།
en: “One should imagine that he is endowed with all the supreme

source: །རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པར་དཀྱིལ་འཁོར་པའང་རབ་ཏུ་བརྟག་པར་བྱའོ།
en: Characteristics consistent with his being the lord of the maṇḍala.
